results/test1/file/d/fio-4k.txt
random-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Jobs: 4 (f=4): [w(4)][100.0%][w=14.2MiB/s][w=3635 IOPS][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1092: Sat Mar 16 18:55:19 2024
  write: IOPS=1603, BW=6413KiB/s (6567kB/s)(377MiB/60236msec); 0 zone resets
    slat (nsec): min=241, max=55445k, avg=90050.69, stdev=585288.36
    clat (nsec): min=551, max=1013.0M, avg=4696337.40, stdev=52080355.57
     lat (usec): min=19, max=1013.0k, avg=4786.39, stdev=52079.91
    clat percentiles (nsec):
     |  1.00th=[       964],  5.00th=[      3312], 10.00th=[     32128],
     | 20.00th=[    226304], 30.00th=[    329728], 40.00th=[    440320],
     | 50.00th=[    544768], 60.00th=[    700416], 70.00th=[    905216],
     | 80.00th=[   1253376], 90.00th=[   1990656], 95.00th=[   3096576],
     | 99.00th=[  23461888], 99.50th=[ 143654912], 99.90th=[ 868220928],
     | 99.95th=[ 901775360], 99.99th=[1002438656]
   bw (  KiB/s): min=  303, max=21504, per=32.07%, avg=8308.73, stdev=4247.17, samples=92
   iops        : min=   75, max= 5376, avg=2077.09, stdev=1061.79, samples=92
  lat (nsec)   : 750=0.50%, 1000=0.56%
  lat (usec)   : 2=2.02%, 4=2.47%, 10=1.98%, 20=1.43%, 50=1.77%
  lat (usec)   : 100=2.08%, 250=9.70%, 500=23.61%, 750=16.95%, 1000=10.30%
  lat (msec)   : 2=16.64%, 4=6.43%, 10=1.96%, 20=0.46%, 50=0.45%
  lat (msec)   : 100=0.13%, 250=0.08%, 500=0.05%, 750=0.15%, 1000=0.26%
  lat (msec)   : 2000=0.01%
  cpu          : usr=1.88%, sys=32.92%, ctx=211085, majf=0, minf=0
  IO depths    : 1=1.0%, 2=6.4%, 4=54.7%, 8=37.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.3%, 8=4.7%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,96574,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1093: Sat Mar 16 18:55:19 2024
  write: IOPS=1594, BW=6377KiB/s (6531kB/s)(375MiB/60249msec); 0 zone resets
    slat (nsec): min=481, max=49580k, avg=91365.64, stdev=565389.02
    clat (nsec): min=551, max=1013.2M, avg=4713443.16, stdev=52210389.18
     lat (usec): min=19, max=1013.3k, avg=4804.81, stdev=52210.14
    clat percentiles (nsec):
     |  1.00th=[      972],  5.00th=[     3216], 10.00th=[    23680],
     | 20.00th=[   222208], 30.00th=[   329728], 40.00th=[   436224],
     | 50.00th=[   552960], 60.00th=[   700416], 70.00th=[   905216],
     | 80.00th=[  1253376], 90.00th=[  1990656], 95.00th=[  3129344],
     | 99.00th=[ 23461888], 99.50th=[147849216], 99.90th=[868220928],
     | 99.95th=[901775360], 99.99th=[994050048]
   bw (  KiB/s): min=  344, max=18312, per=31.85%, avg=8251.03, stdev=4158.59, samples=92
   iops        : min=   86, max= 4578, avg=2062.67, stdev=1039.66, samples=92
  lat (nsec)   : 750=0.45%, 1000=0.59%
  lat (usec)   : 2=2.20%, 4=2.38%, 10=2.21%, 20=1.68%, 50=1.98%
  lat (usec)   : 100=2.03%, 250=9.52%, 500=23.01%, 750=16.76%, 1000=10.48%
  lat (msec)   : 2=16.74%, 4=6.38%, 10=1.96%, 20=0.48%, 50=0.47%
  lat (msec)   : 100=0.13%, 250=0.07%, 500=0.04%, 750=0.16%, 1000=0.26%
  lat (msec)   : 2000=0.01%
  cpu          : usr=1.87%, sys=33.01%, ctx=207694, majf=0, minf=0
  IO depths    : 1=0.8%, 2=6.1%, 4=55.4%, 8=37.8%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.3%, 8=4.7%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,96059,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1094: Sat Mar 16 18:55:19 2024
  write: IOPS=1615, BW=6463KiB/s (6619kB/s)(380MiB/60269msec); 0 zone resets
    slat (nsec): min=251, max=45097k, avg=85435.61, stdev=518475.03
    clat (nsec): min=511, max=1015.3M, avg=4674406.85, stdev=51892850.99
     lat (usec): min=16, max=1015.3k, avg=4759.84, stdev=51891.78
    clat percentiles (nsec):
     |  1.00th=[      900],  5.00th=[     2864], 10.00th=[    23424],
     | 20.00th=[   220160], 30.00th=[   325632], 40.00th=[   440320],
     | 50.00th=[   552960], 60.00th=[   708608], 70.00th=[   913408],
     | 80.00th=[  1269760], 90.00th=[  2023424], 95.00th=[  3129344],
     | 99.00th=[ 22675456], 99.50th=[114819072], 99.90th=[868220928],
     | 99.95th=[901775360], 99.99th=[994050048]
   bw (  KiB/s): min=  144, max=21072, per=32.31%, avg=8369.65, stdev=4230.45, samples=92
   iops        : min=   36, max= 5268, avg=2092.33, stdev=1057.62, samples=92
  lat (nsec)   : 750=0.58%, 1000=0.64%
  lat (usec)   : 2=2.28%, 4=2.52%, 10=2.14%, 20=1.45%, 50=1.74%
  lat (usec)   : 100=2.34%, 250=9.50%, 500=22.43%, 750=16.92%, 1000=10.47%
  lat (msec)   : 2=16.77%, 4=6.69%, 10=1.91%, 20=0.52%, 50=0.45%
  lat (msec)   : 100=0.13%, 250=0.07%, 500=0.05%, 750=0.14%, 1000=0.26%
  lat (msec)   : 2000=0.01%
  cpu          : usr=1.92%, sys=33.45%, ctx=216617, majf=0, minf=0
  IO depths    : 1=0.8%, 2=5.6%, 4=53.8%, 8=39.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.6%, 8=4.4%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,97386,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1095: Sat Mar 16 18:55:19 2024
  write: IOPS=1664, BW=6659KiB/s (6819kB/s)(392MiB/60257msec); 0 zone resets
    slat (nsec): min=481, max=55414k, avg=76582.10, stdev=513322.30
    clat (nsec): min=551, max=1013.1M, avg=4559571.23, stdev=51114825.12
     lat (usec): min=17, max=1013.1k, avg=4636.15, stdev=51114.56
    clat percentiles (nsec):
     |  1.00th=[      956],  5.00th=[     3664], 10.00th=[    56064],
     | 20.00th=[   234496], 30.00th=[   337920], 40.00th=[   440320],
     | 50.00th=[   552960], 60.00th=[   692224], 70.00th=[   905216],
     | 80.00th=[  1253376], 90.00th=[  1990656], 95.00th=[  3096576],
     | 99.00th=[ 21102592], 99.50th=[110624768], 99.90th=[859832320],
     | 99.95th=[901775360], 99.99th=[994050048]
   bw (  KiB/s): min=  159, max=17992, per=33.26%, avg=8615.30, stdev=4365.30, samples=92
   iops        : min=   39, max= 4498, avg=2153.73, stdev=1091.32, samples=92
  lat (nsec)   : 750=0.50%, 1000=0.60%
  lat (usec)   : 2=2.04%, 4=2.05%, 10=1.78%, 20=1.28%, 50=1.49%
  lat (usec)   : 100=2.03%, 250=9.83%, 500=24.36%, 750=17.09%, 1000=10.31%
  lat (msec)   : 2=16.75%, 4=6.33%, 10=1.96%, 20=0.54%, 50=0.43%
  lat (msec)   : 100=0.11%, 250=0.08%, 500=0.04%, 750=0.15%, 1000=0.25%
  lat (msec)   : 2000=0.01%
  cpu          : usr=2.00%, sys=34.53%, ctx=223272, majf=0, minf=0
  IO depths    : 1=0.6%, 2=5.0%, 4=52.5%, 8=41.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.1%, 8=3.9%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,100310,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=25.3MiB/s (26.5MB/s), 6377KiB/s-6659KiB/s (6531kB/s-6819kB/s), io=1525MiB (1599MB), run=60236-60269msec